Pacotes para Utilizar

In [44]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

Importando os dados para apreciação.

In [45]:
df = pd.read_csv("salario_profissionais_dados.csv")
df.head(8)

,work_year,country,region,experience_level,job_title,salary_in_usd,employee_residence,company_location,company_size,years_of_experience
0,2023,Spain,Europe,SE,Principal Data Scientist,85847,ES,ES,L,8
1,2023,United States of America,Americas,MI,ML Engineer,30000,US,US,S,5
2,2023,United States of America,Americas,MI,ML Engineer,25500,US,US,S,3
3,2023,Canada,Americas,SE,Data Scientist,175000,CA,CA,M,8
4,2023,Canada,Americas,SE,Data Scientist,120000,CA,CA,M,8
5,2023,United States of America,Americas,SE,Applied Scientist,222200,US,US,L,6
6,2023,United States of America,Americas,SE,Applied Scientist,136000,US,US,L,6
7,2023,Canada,Americas,SE,Data Scientist,219000,CA,CA,M,6

Analisando o estado dos dados para se preparar para realizar as análises.

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   work_year            3755 non-null   int64
 1   country              3755 non-null   object
 2   region               3755 non-null   object
 3   experience_level     3755 non-null   object
 4   job_title            3755 non-null   object
 5   salary_in_usd        3755 non-null   int64
 6   employee_residence   3755 non-null   object
 7   company_location     3755 non-null   object
 8   company_size         3755 non-null   object
 9   years_of_experience  3755 non-null   int64
dtypes: int64(3), object(7)
memory usage: 293.5+ KB

In [47]:
df.dtypes

work_year               int64
country                object
region                 object
experience_level       object
job_title              object
salary_in_usd           int64
employee_residence     object
company_location       object
company_size           object
years_of_experience     int64
dtype: object

In [48]:
df.shape

(3755, 10)

In [49]:
df.describe()

         work_year  salary_in_usd  years_of_experience
count  3755.000000    3755.000000          3755.000000
mean   2022.373635  137570.389880             5.970972
std       0.691448   63055.625278             2.062673
min    2020.000000    5132.000000             1.000000
25%    2022.000000   95000.000000             5.000000
50%    2022.000000  135000.000000             6.000000
75%    2023.000000  175000.000000             8.000000
max    2023.000000  450000.000000            10.000000


Procurando valores nulos (embora esta informação já tenha ficado clara na primeira análise, apenas para simples conferência de domínio dos comandos)

In [50]:
df.isnull().sum()

work_year              0
country                0
region                 0
experience_level       0
job_title              0
salary_in_usd          0
employee_residence     0
company_location       0
company_size           0
years_of_experience    0
dtype: int64

In [51]:
df.isna().sum()

work_year              0
country                0
region                 0
experience_level       0
job_title              0
salary_in_usd          0
employee_residence     0
company_location       0
company_size           0
years_of_experience    0
dtype: int64

In [62]:
df.nunique()

work_year                 4
country                  78
region                    5
experience_level          4
job_title                93
salary_in_usd          1035
employee_residence       78
company_location         72
company_size              3
years_of_experience      10
dtype: int64

Verificando a reincidência dos dados: Tipo de empregado, nível de experiência e Tamanho da empresa. (Em porcentagens)

In [53]:
(df['job_title']).value_counts(normalize=True).head(10) * 100

job_title
Data Engineer                27.696405
Data Scientist               22.370173
Data Analyst                 16.298269
Machine Learning Engineer     7.696405
Analytics Engineer            2.743009
Data Architect                2.689747
Research Scientist            2.183755
Applied Scientist             1.544607
Data Science Manager          1.544607
Research Engineer             0.985353
Name: proportion, dtype: float64

In [54]:
(df['experience_level']).value_counts(normalize=True).head(10) * 100

experience_level
SE    67.003995
MI    21.438083
EN     8.521971
EX     3.035952
Name: proportion, dtype: float64

In [55]:
(df['company_size']).value_counts(normalize=True).head(10) * 100

company_size
M    83.968043
L    12.090546
S     3.941411
Name: proportion, dtype: float64

Retirando a Média, Mediana dos salários:

In [65]:
mediasalary = df['salary_in_usd'].mean()
print(f"Media dos salários: USD {mediasalary:.2f}")

Media dos salários: USD 137570.39

In [68]:
medianasalary = df['salary_in_usd'].median()
print(f"Mediana dos salários: USD {medianasalary:.2f}")

Mediana dos salários: USD 135000.00